
/*--------------------------------------------------------------
微信开放平台：https://open.weixin.qq.com/

**网站应用开发**：网站使用微信账号登陆，账号体系联系起来，自然获取，人口学信息，地理区域；
    降低用户登陆门槛，开发多个应用，UnionID

**移动应用开发**：支持微信分享、收藏，支付接口，应用应用在社交网络快速传播；在应用里调用支付

**公众号第三方平台**：第三方平台，基于微信的平台。

**公众账号开发**：微信申请公众账号，更容易获得用户，native app在各大市场分发，微信本身就是
    一个海量的平台。

微信公众平台技术文档：https://mp.weixin.qq.com/wiki?t=resource/res_main&id=mp1445241432
--------------------------------------------------------------*/


/*--------------------------------------------------------------
公众号浏览器开发交互流程

个人 <==>  开发者网站 <==> 微信服务器

1、服务器需要实现接入：https://mp.weixin.qq.com/wiki?t=resource/res_main&id=mp1421135319
    视频教程：https://www.youtube.com/watch?v=7NoO1HcY9V4&list=PLGmd9-PCMLhbCudobEBnMq0UA45_diQbg&index=5

    优化ecs命令行：https://www.youtube.com/watch?v=BhD1hz7voUw&list=PLGmd9-PCMLhbCudobEBnMq0UA45_diQbg&index=6

--------------------------------------------------------------*/

/*--------------------------------------------------------------
Python Server Backend

signature, token generator, jsapi_ticket
--------------------------------------------------------------*/